### Selecting Data in a DataFrame

#### Exercise 1: Pandas: DataFrame and Series

<b>Pandas</b> is a popular library for data analysis built on top of the Python programming language. Pandas generally provide two data structures for manipulaiting data, Ther are:
* DataFrame
* Series 

A <b>DataFrame</b> is a two-dimensional data structure

* A Pandas DataFrame will be created by loading the datasetas from existing storage.
* Storage can be SQL Database, CSV file, Excel file, etx.
* It can also be created from the lists, dictionaries, and from list of dictionaries.

<b>Series</b> represents a one-dimensional array of indexed data. It has two main components:
1. An array of actual data.
2. An associated arrof if indexes or data lables.

The index is used to access individual data values. You can also get a column of a dataframe as a <b>Series</b>. You can think of a Pandas series as a 1-D dataframe.

In [6]:
# let us import the Pandas Library
import pandas as pd

Once you've importend pandas, you can then use the functions built in it to create an analyze data.

Let use consider a dictionary "x" with keys and values as shown beloe.

We then create a datafram from the dictionary using the function pd.DataFrame(dict)

In [43]:
x = {"Name":["Rose","John","Jane","Mary"],"ID":[1,2,3,4], "Deparment":["Architect Group","Sotfware Group","Desing Group","Infrastructure"],"Salary":[100000,80000,50000,60000]}
x

{'Name': ['Rose', 'John', 'Jane', 'Mary'],
 'ID': [1, 2, 3, 4],
 'Deparment': ['Architect Group',
  'Sotfware Group',
  'Desing Group',
  'Infrastructure'],
 'Salary': [100000, 80000, 50000, 60000]}

In [86]:
# Define a dictionary "x"

x = {"Name":["Rose","John","Jane","Mary"],"ID":[1,2,3,4], "Department":["Architect Group","Sotfware Group","Desing Group","Infrastructure"],"Salary":[100000,80000,50000,60000]}

# casting the dictionary to a DataFrame

df = pd.DataFrame(x)

# Display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Sotfware Group   80000
2  Jane   3     Desing Group   50000
3  Mary   4   Infrastructure   60000

We can se the direct corespondence between the table. The keys correspond to the clumns labels and the values or lists correspond to the rows.

#### Columns Selection:

To select a column in Pandas DataFrame, we can either access the columns by calling them by their columns name.

Let's Retrive the data present int the <code>ID</code> column.

In [48]:
# Retrieving the "ID" column and assigning it to a variable x
x=df[["ID"]]
x

   ID
0   1
1   2
2   3
3   4

Let's use the <code>type()</code> function and check the type of the variable.

In [32]:
# Chech the type of x

type(x)

pandas.core.frame.DataFrame

The output shows use that the type of the variable is a DataFrame object.

#### Access top a multiplie columns

Let us retrive the data for <code>Deparment</code> , <code>Salary</code> , and <code>ID</code> columns.

In [50]:
# Retrivienf the Department, Salary and ID columns and assigning it to a variable z

z = df[["Department","Salary","ID"]]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Sotfware Group   80000   2
2     Desing Group   50000   3
3   Infrastructure   60000   4

#### Try it yoursef

<b>Problem 1: Create a Dataframe to display the result:

In [80]:
x = {"Student":["David","Samuel","Terry","Evan"],"Age":[27,24,22,32],"Country":["UK","Canada","China","USA"],"Course":["Python","Data Structure","Machine learning","Web Development"],"Marks":[85,72,89,76]}
x

df1 = pd.DataFrame(x)
df1

  Student  Age Country            Course  Marks
0   David   27      UK            Python     85
1  Samuel   24  Canada    Data Structure     72
2   Terry   22   China  Machine learning     89
3    Evan   32     USA   Web Development     76

<b>Problem 2: Retrive the Marks column and assing it to a variable b</b>

In [84]:
b = df1[["Marks"]]
b

   Marks
0     85
1     72
2     89
3     76

<b>Problem 3: Retrive the Country and Course columns and assing it to a variable c</b>

In [82]:
c =df1[["Country","Course"]]
c

  Country            Course
0      UK            Python
1  Canada    Data Structure
2   China  Machine learning
3     USA   Web Development

#### To view the column as a series, just use one bracket:

In [70]:
# Get the Student column as a series object

x = df["Student"]
x

0     David
1    Samuel
2     Terry
3      Evan
Name: Student, dtype: object

### Exercise 2: <code>loc()</code> and <code>iloc()</code> functions

<code>loc()</code> is a label-based data selecting method which means taht we have to pass the name of the row or column that we want to select. This method includes the last element of the range passed in it.

Simple syntax for ypur understanding:
* loc[row_label,column_label]

<code>iloc()</code> is an index-based selecting method which means that we have to pass an integer inde i the method to select a specific row/column. this method does not include the last element of the range passed in it.

Simple syntax
* iloc[row_index,column_index]

#### Let us see some example on the same

In [88]:
# Access the value on the first row and the first column

df.iloc[0,0]

'Rose'

In [90]:
# Access the value on the first row and the third column

df.iloc[0,3]

100000

In [94]:
# Access the column using the name 

df.loc[0,"Salary"]

100000

Let us create a new dataframe called "df2" and assign "df" to it. Now, let us set the "Name" column as an index column using the method set_index()

In [98]:
df2=df
df2=df.set_index("Name")

In [100]:
# To displat the 5 first rows of new data frame
df.head()

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Sotfware Group   80000
2  Jane   3     Desing Group   50000
3  Mary   4   Infrastructure   60000

In [104]:
# Now let us access the column using the name

df2.loc["Jane","Salary"]

50000

#### Try it yoursef 

Use the <code>loc()</code> function, to get Department of Jane in the newly created dataframe df2.

In [113]:
df2.loc["Jane","Department"]

'Desing Group'

Use the <code>iloc()</code> function to get the Salart of Marty in the newly created dataframe df2.

In [118]:
df2.iloc[3,2]

60000

### Exercise 3: Slicing

Slicing uses the [] operator to select a set of rows and/or columns from a DataFGrame.

To slice out a set of rows, you use this syntaz: data[stars:stop]

Here the start represents the index grom where to condiser, and stop represents the index one step BEYOND the row you want to seect. You can perform slicing using both the index and the name of the column.

#### We can aso select a specific data value using row and column location within the DataFrame and iloc indexing.

In [124]:
# Let us do the slicing using old dataframe df

df.iloc[0:2,0:3]

   Name  ID       Department
0  Rose   1  Architect Group
1  John   2   Sotfware Group

In [128]:
# Let us do the slicing using loc() function on old dataframe df where index column is having labes as 0,1,2,
df.loc[0:2,"ID":"Department"]

   ID       Department
0   1  Architect Group
1   2   Sotfware Group
2   3     Desing Group

In [130]:
# Let us do the slicing using loc() function on new dataframe df2 where index column is Name having labels: Rose, John and Jane 

df2.loc["Rose":"Jane","ID":"Department"]

      ID       Department
Name
Rose   1  Architect Group
John   2   Sotfware Group
Jane   3     Desing Group

#### Try it yourself
using <code>loc()</code> function, do slicing on old dataframe df to retrive the Name, ID and Department of index column having lables as 2, 3

In [135]:
df.loc[2:3,"Name":"Department"]

   Name  ID      Department
2  Jane   3    Desing Group
3  Mary   4  Infrastructure